ruby/userManage2/app/controllers/product_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdfasdfa"], ["description", "asdfadsf"], ["price", 4.0], ["created_at", "2017-01-18 23:07:03.783469"], ["updated_at", "2017-01-18 23:07:03.783469"]]
---
  def new
    puts params
    product = Product.create(name: params[:name], description: params[:description], price: params[:price])

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]
---
  def delete
    Product.delete(params[:id])

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "its aadfasdfasdf"], ["updated_at", "2017-01-20 17:24:00.458528"], ["id", 8]]
---
  def change
    puts params
    @edited = Product.update(params[:id],name: params[:name], description: params[:description], price: params[:price])